#### Consider following code to answer further questions:
#### import pandas as pd
#### course_name = [‘Data Science’, ‘Machine Learning’, ‘Big Data’, ‘Data Engineer’]
#### duration = [2,3,6,4]
#### df = pd.DataFrame(data = {‘course_name’ : course_name, ‘duration’ : duration})

#### Q1. Write a code to print the data present in the second row of the dataframe, df.

#### Q2. What is the difference between the functions loc and iloc in pandas.DataFrame?

#### Q3. Reindex the given dataframe using a variable, reindex = [3,0,1,2] and store it in the variable, new_df then find the output for both new_df.loc[2] and new_df.iloc[2].

#### Q4. Write a code to find the following statistical measurements for the above dataframe df1:
#### (i) mean of each and every column present in the dataframe.
#### (ii) standard deviation of column, ‘column_2’

#### Q5. Replace the data present in the second row of column, ‘column_2’ by a string variable then find the mean of column, column_2.If you are getting errors in executing it then explain why.
#### [Hint: To replace the data use df1.loc[] and equate this to string data of your choice.]

#### Q6. What do you understand about the windows function in pandas and list the types of windows functions?

#### Q7. Write a code to print only the current month and year at the time of answering this question.
#### [Hint: Use pandas.datetime function]

#### Q8. Write a Python program that takes in two dates as input (in the format YYYY-MM-DD) and calculates the difference between them in days, hours, and minutes using Pandas time delta. The program should prompt the user to enter the dates and display the result.

#### Q9. Write a Python program that reads a CSV file containing categorical data and converts a specified column to a categorical data type. The program should prompt the user to enter the file path, column name, and category order, and then display the sorted data.

#### Q10. Write a Python program that reads a CSV file containing sales data for different products and visualizes the data using a stacked bar chart to show the sales of each product category over time. The program should prompt the user to enter the file path and display the chart.

#### Q11. You are given a CSV file containing student data that includes the student ID and their test score. Write a Python program that reads the CSV file, calculates the mean, median, and mode of the test scores, and displays the results in a table.The program should do the following :

#### Prompt the user to enter the file path of the CSV file containing the student dataR
#### Read the CSV file into a Pandas DataFrameR
#### Calculate the mean, median, and mode of the test scores using Pandas toolsR
#### Display the mean, median, and mode in a table.

#### Assume the CSV file contains the following columns
#### Student ID: The ID of the studentR
#### Test Score: The score of the student's test.

#### Example usage of the program:
#### Enter the file path of the CSV file containing the student data: student_data.csv
+-----------+--------+
| Statistic | Value |
+-----------+--------+
| Mean | 79.6 |
| Median | 82 |
| Mode | 85, 90 |
+-----------+--------+
Assume that the CSV file student_data.csv contains the following data:
Student ID,Test Score
1,85
2,90
3,80
4,75
5,85
6,82
7,78
8,85
9,90
10,85
The program should calculate the mean, median, and mode of the test scores and display the results
in a table.

## Answers

In [2]:
import pandas as pd
course_name = ['Data Science', 'Machine Learning', 'Big Data', 'Data Engineer']
duration = [2,3,6,4]
df = pd.DataFrame(data = {'course_name' : course_name, 'duration' : duration})
df.head()

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

### Q1. Write a code to print the data present in the second row of the dataframe, df.

In [10]:
df[1:2]

        course_name  duration
1  Machine Learning         3

### Q2. What is the difference between the functions loc and iloc in pandas.DataFrame?

#### loc : 
### 1. 
loc is label-based indexing. It is used to access rows and columns in a DataFrame by specifying their labels or index names.

#### df.loc[row_labels, column_labels]
### 2.
The loc() function is label based data selecting method which means that we have to pass the name of the row or column which we want to select. This method includes the last element of the range passed in it, unlike iloc(). loc() can accept the boolean data unlike iloc().

In [49]:
df.loc[[0,1,2]]

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6

In [25]:
df.loc[0:2]

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6

In [46]:
df.loc[:]

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

In [48]:
df.loc[(df.course_name=='Data Science') & (df.duration>=2)]

    course_name  duration
0  Data Science         2

In [22]:
df.loc[0:2,"course_name"]

0        Data Science
1    Machine Learning
2            Big Data
Name: course_name, dtype: object

In [24]:
df.loc[0:1,["course_name","duration"]]

        course_name  duration
0      Data Science         2
1  Machine Learning         3

#### iloc:
### 1.
iloc is integer-based indexing. It is used to access rows and columns in a DataFrame by specifying their integer positions.

#### df.iloc[row_positions, column_positions]

### 2. 
The iloc() function is an indexed-based selecting method which means that we have to pass an integer index in the method to select a specific row/column. This method does not include the last element of the range passed in it unlike loc(). iloc() does not accept the boolean data unlike loc().

In [31]:
df.iloc[[1,2,3]]

        course_name  duration
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

In [33]:
df.iloc[0:2]

        course_name  duration
0      Data Science         2
1  Machine Learning         3

In [39]:
df.iloc[0:2,0:2]

        course_name  duration
0      Data Science         2
1  Machine Learning         3

In [42]:
df.iloc[:,0:2]

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

In [45]:
df.iloc[:]

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

### Q3. Reindex the given dataframe using a variable, reindex = [3,0,1,2] and store it in the variable, new_df then find the output for both new_df.loc[2] and new_df.iloc[2].

In [50]:
reindex = [3,0,1,2]
new_df=df.reindex(index=reindex)

In [51]:
new_df.head()

        course_name  duration
3     Data Engineer         4
0      Data Science         2
1  Machine Learning         3
2          Big Data         6

In [52]:
new_df.loc[2]

course_name    Big Data
duration              6
Name: 2, dtype: object

In [53]:
new_df.iloc[2]

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

### Q4. Write a code to find the following statistical measurements for the above dataframe df1:
### (i) mean of each and every column present in the dataframe.
### (ii) standard deviation of column, ‘column_2’

In [55]:
import pandas as pd
import numpy as np
columns = ['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6']
indices = [1,2,3,4,5,6]
#Creating a dataframe:
df1 = pd.DataFrame(np.random.rand(6,6), columns = columns, index = indices)

In [56]:
df1.head()

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.800871  0.407094  0.944008  0.647755  0.280966  0.602322
2  0.999827  0.369134  0.861388  0.836500  0.926002  0.000726
3  0.613781  0.322205  0.421086  0.923603  0.632716  0.742715
4  0.125979  0.319728  0.953973  0.035041  0.208665  0.764247
5  0.722567  0.484842  0.539994  0.848564  0.741532  0.276490

In [57]:
df1.mean()

column_1    0.704422
column_2    0.336691
column_3    0.673172
column_4    0.586183
column_5    0.547272
column_6    0.439162
dtype: float64

In [61]:
df1[["column_2"]].std()

column_2    0.123819
dtype: float64

### Q5. Replace the data present in the second row of column, ‘column_2’ by a string variable then find the mean of column, column_2.If you are getting errors in executing it then explain why.

### [Hint: To replace the data use df1.loc[] and equate this to string data of your choice.]

In [62]:
df1.head()

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.800871  0.407094  0.944008  0.647755  0.280966  0.602322
2  0.999827  0.369134  0.861388  0.836500  0.926002  0.000726
3  0.613781  0.322205  0.421086  0.923603  0.632716  0.742715
4  0.125979  0.319728  0.953973  0.035041  0.208665  0.764247
5  0.722567  0.484842  0.539994  0.848564  0.741532  0.276490

In [71]:
df1.loc[2:2,'column_2']="Madhu"

In [72]:
df1.head()

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.800871  0.407094  0.944008  0.647755  0.280966  0.602322
2  0.999827     Madhu  0.861388  0.836500  0.926002  0.000726
3  0.613781  0.322205  0.421086  0.923603  0.632716  0.742715
4  0.125979  0.319728  0.953973  0.035041  0.208665  0.764247
5  0.722567  0.484842  0.539994  0.848564  0.741532  0.276490

In [75]:
# Getting the error beacuse we can not find the mean of a string data type
df1["column_2"].mean()

1    0.407094
2       Madhu
3    0.322205
4    0.319728
5    0.484842
6    0.117145
Name: column_2, dtype: object

### Q6. What do you understand about the windows function in pandas and list the types of windows functions?

### window functions :
"window functions" refer to a class of operations that perform calculations over a specified sliding or rolling window of data points in a DataFrame or Series. These operations allow us to compute aggregated values for a group of adjacent data points rather than considering the entire dataset at once. Window functions are particularly useful for time series data or any sequential data where the order matters.

### 2. 
The sliding or rolling window concept involves taking a fixed-size window and sliding it across the data, performing a calculation within the window, and then moving the window one step forward to repeat the calculation for the next window.

####  1. rolling() :
This function is used to create a rolling window view of a DataFrame or Series. It is typically followed by an aggregation function (e.g., mean(), sum(), std(), etc.) to calculate values over each window.

#### 2. expanding() : 
The expanding window function calculates the value of a statistic, including all data points from the start of the data up to the current point. It gives a cumulative view of the data

#### 3. ewm() : 
Exponentially Weighted Moving Average (EWMA) is a type of window function that assigns exponentially decreasing weights to data points as they get further from the current point. This function is often used to smooth noisy time series data.

In [90]:

data = {'A': [10, 20, 30, 40, 50]}
df2 = pd.DataFrame(data)

# Rolling Window Mean
df2['Rolling_Mean'] = df2['A'].rolling(window=2).mean()

# Expanding Window Sum
df2['Expanding_Sum'] = df2['A'].expanding().sum()

# Exponentially Weighted Moving Average (EWMA)
df2['EWMA'] = df2['A'].ewm(span=3, adjust=False).mean()

print(df2)

    A  Rolling_Mean  Expanding_Sum    EWMA
0  10           NaN           10.0  10.000
1  20          15.0           30.0  15.000
2  30          25.0           60.0  22.500
3  40          35.0          100.0  31.250
4  50          45.0          150.0  40.625

### Q7. Write a code to print only the current month and year at the time of answering this question.

### [Hint: Use pandas.datetime function]

In [82]:
print("Current Month is : ",pd.Timestamp.now().month)
print("Current Year is : ",pd.Timestamp.now().year)

Current Month is :  7
Current Year is :  2023

### Q8. Write a Python program that takes in two dates as input (in the format YYYY-MM-DD) and calculates the difference between them in days, hours, and minutes using Pandas time delta. The program should prompt the user to enter the dates and display the result.

In [79]:
import pandas as pd

def get_datetime_from_input(prompt):
    while True:
        try:
            date_input = input(prompt)
            datetime_obj = pd.to_datetime(date_input)
            return datetime_obj
        except ValueError:
            print("Invalid date format. Please enter the date in the format YYYY-MM-DD.")

def calculate_time_difference(start_date, end_date):
    time_delta = end_date - start_date
    days = time_delta.days
    hours = time_delta.seconds // 3600
    minutes = (time_delta.seconds // 60) % 60
    return days, hours, minutes

if __name__ == "__main__":
    print("Please enter two dates in the format YYYY-MM-DD.")

    start_date = get_datetime_from_input("Enter the start date: ")
    end_date = get_datetime_from_input("Enter the end date: ")

    if start_date > end_date:
        print("Start date cannot be greater than the end date.")
    else:
        days_diff, hours_diff, minutes_diff = calculate_time_difference(start_date, end_date)

        print("\nDifference between the two dates:")
        print(f"Days: {days_diff}")
        print(f"Hours: {hours_diff}")
        print(f"Minutes: {minutes_diff}")

Please enter two dates in the format YYYY-MM-DD.

Enter the start date:  2023-11-12
Enter the end date:  2023-12-12

Difference between the two dates:
Days: 30
Hours: 0
Minutes: 0

### Q9. Write a Python program that reads a CSV file containing categorical data and converts a specified column to a categorical data type. The program should prompt the user to enter the file path, column name, and category order, and then display the sorted data.

In [34]:
import pandas as pd
import os
os.chdir('Data')

In [71]:
path=input("Enter File path : ")
df5=pd.read_csv(path)

Enter File path :  Student.csv

In [72]:
df5.head()

   Roll_No   Name
0        1  Madhu
1        2  Rajat
2        3  Vikas
3        4    Jay
4        5    Raj

In [73]:
column=input("Enter Column Name : ")

Enter Column Name :  Name

In [76]:
category_order = input("Enter the category order (comma-separated): ").split(',')

Enter the category order (comma-separated):  Madhu,Raj

In [77]:
df5[column] = pd.Categorical(df5[column],categories=category_order,ordered=True)

In [78]:
sorted_df = df5.sort_values(by=column)
sorted_df.head()

   Roll_No   Name
0        1  Madhu
4        5    Raj
1        2    NaN
2        3    NaN
3        4    NaN

### Q11. You are given a CSV file containing student data that includes the student ID and their test score. Write a Python program that reads the CSV file, calculates the mean, median, and mode of the test scores, and displays the results in a table.The program should do the following :

In [1]:
import pandas as pd

In [14]:
filepath=input("Enter the file path : ")

Enter the file path :  student_data.csv

In [15]:
df4=pd.read_csv(filepath)

In [16]:
df4.head()

   Student ID  Test Score
0           1          85
1           2          90
2           3          80
3           4          75
4           5          85

In [17]:
mean=df4[["Test Score"]].mean()

In [18]:
median=df4[["Test Score"]].median()

In [29]:
mode=df4[["Test Score"]].mode()
mode

   Test Score
0          85

In [33]:
mode.loc[0]

Test Score    85
Name: 0, dtype: int64

In [34]:
df5=pd.DataFrame({"Mean":mean,
                 "Median":median,
                  "Mode":mode.loc[0]
                 })

In [35]:
df5.head()

            Mean  Median  Mode
Test Score  83.5    85.0    85

In [36]:
from tabulate import tabulate
print(tabulate(df5, headers = 'keys', tablefmt = 'psql'))

+------------+--------+----------+--------+
|            |   Mean |   Median |   Mode |
|------------+--------+----------+--------|
| Test Score |   83.5 |       85 |     85 |
+------------+--------+----------+--------+

In [26]:
pip install tabulate

Collecting tabulate
  Downloading tabulate-0.9.0-py3-none-any.whl (35 kB)
Installing collected packages: tabulate
Successfully installed tabulate-0.9.0
Note: you may need to restart the kernel to use updated packages.